-----
### 위치 데이터
-----
1. 위치 데이터는 주로 경도와 위도 (x, y) 좌표 쌍으로 표현
2. 사용자의 위치가 실시간으로 변할 때, 이 데이터를 신속하게 저장하고 처리할 수 있는 데이터 저장소는 다음과 같은 기능을 제공해야 함
   - 사용자의 현재 위치 파악
   - 사용자의 이동에 따른 실시간 변동 위치 업데이트
   - 사용자의 위치를 기준으로 근처 장소 검색

3. 단순하게 데이터를 읽고(사용자 위치 파악), 쓰는 것(실시간 위치 업데이트)은 간단해 보이지만, 사용자가 늘어나면 이 기능도 문제가 될 수 있음
   - 모든 사용자 정보를 1초마다 업데이트 한다고 가정하면, 사용자 증가에 따른 위치 데이터는 몇 십배로 증가
   - 또한, 위치 데이터끼리의 연산(사용자 근처 맛집 검색)은 위치 데이터를 가공해야 하므로 까다롭게 처리될 수 있음

-----
### 레디스에서의 위치 데이터
-----
1. 레디스는 geo 자료 구조를 통해 공간 정보 데이터를 처리할 수 있음
2. 다른 자료 구조와 마찬가지로 모든 데이터는 메모리에 저장되며, 공간 데이터를 활용한 연산 역시 메모리에서 빠르게 계산될 수 있어서 다른 저장소보다 위치 데이터를 효율적으로 처리할 수 있음
3. 관계형 데이터베이스를 이용해 위치 데이터를 처리할 때는 데이터를 단순 저장할 뿐이며, 실제 데이터 가공 및 처리 과정은 저장소 외부에서 이뤄져야 함
   - 그러나 레디스를 활용하면 데이터 저장뿐만 아니라 실시간 위치를 수행할 수 있어, 데이터 이동으로 인한 네트워크 트래픽을 감소시키고 애플리케이션 코드의 복잡성을 감소시킬 수 있으므로 빠른 서비스 응답 속도 보장

4. 레디스의 geo 기능을 레디스의 다른 기능과 조합해 사용하면 손쉽게 빠르고 효율적인 서비스 구현 가능
   - 예를 들어, geo set과 pub/sub 기능을 함께 사용하면 특정 맛집에서 이벤트를 발생시킬 때, 해당 지역 근처의 사용자에게 실시간 알림을 보내는 서비스를 간단하게 구축 가능

